In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

## create dataframe using the Dict value

In [3]:
df = pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
df['Marks'] = df['Marks'] + 10
df

      Name  Marks  Gender
0  Priyang    118    Male
1   Aadhya    109  Female
2   Krisha    119  Female
3   Vedant    107    Male
4   Parshv    110    Male
5   Mittal    103  Female
6  Archana    119  Female

## show top 3 element

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## show last 3 element

In [6]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## how many columns and rows there

In [8]:
 df.shape

(7, 3)

## show columns rows and datatypes of each column and memory usage

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## check Null values in datasets

In [17]:
df.isnull()
#df.isnull..sum(axis =0)

Name      0
Marks     0
Gender    0
dtype: int64

## get overall statistics about the dataframe

In [21]:
df.describe()
#df.describe(include ="all")

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

## find unique values from the Gender Column

In [26]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [29]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## find the Number of Unique values from the Gender Column

In [30]:
df['Gender'].nunique()

2

## display count of unique values

In [32]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## total number of students having marks 90 to 100

In [43]:
df[ df['Marks'] >= 90 ]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [47]:
df[ (df['Marks'] >= 90)  & (df['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

## total number of students having marks 90 to 100 using Between

In [49]:
df[df['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

## find average Marks

In [54]:
df['Marks'].mean()

92.14285714285714

In [57]:
df['Marks'].min()   #max()

83

## Apply Method()

In [58]:
 df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [63]:
def half(x):
    return x//2

In [64]:
df['half_marks'] = df['Marks'].apply(half)

In [65]:
df

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [69]:
df['half_float'] = df['Marks'].apply(lambda x : x / 2)

In [70]:
df

      Name  Marks  Gender  half_marks  half  half_float
0  Priyang     98    Male          49    49        49.0
1   Aadhya     89  Female          44    44        44.5
2   Krisha     99  Female          49    49        49.5
3   Vedant     87    Male          43    43        43.5
4   Parshv     90    Male          45    45        45.0
5   Mittal     83  Female          41    41        41.5
6  Archana     99  Female          49    49        49.5

## length using apply

In [76]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## MAP function

In [80]:
df['male_fem'] = df['Gender'].map({'Male':0 ,'Female':1})

In [81]:
df

      Name  Marks  Gender  half_marks  half  half_float  male_fem
0  Priyang     98    Male          49    49        49.0         0
1   Aadhya     89  Female          44    44        44.5         1
2   Krisha     99  Female          49    49        49.5         1
3   Vedant     87    Male          43    43        43.5         0
4   Parshv     90    Male          45    45        45.0         0
5   Mittal     83  Female          41    41        41.5         1
6  Archana     99  Female          49    49        49.5         1

## drop the column(s)

In [83]:
df.drop('half_marks',axis = 1)

      Name  Marks  Gender  half  half_float  male_fem
0  Priyang     98    Male    49        49.0         0
1   Aadhya     89  Female    44        44.5         1
2   Krisha     99  Female    49        49.5         1
3   Vedant     87    Male    43        43.5         0
4   Parshv     90    Male    45        45.0         0
5   Mittal     83  Female    41        41.5         1
6  Archana     99  Female    49        49.5         1

In [84]:
l = ['half','half_float','male_fem']
df.drop(l, axis =1)

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [95]:
df.drop('half_marks',axis=1,inplace=True)

In [96]:
df

      Name  Marks  Gender  half_float  male_fem
0  Priyang     98    Male        49.0         0
1   Aadhya     89  Female        44.5         1
2   Krisha     99  Female        49.5         1
3   Vedant     87    Male        43.5         0
4   Parshv     90    Male        45.0         0
5   Mittal     83  Female        41.5         1
6  Archana     99  Female        49.5         1

In [97]:
l = ['half_float','male_fem']
df.drop(l, axis =1,inplace =True)

In [99]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## print name of columns

In [100]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [101]:
df.index

RangeIndex(start=0, stop=7, step=1)

## sort the Dataframe as per Mark column

In [106]:
df.sort_values(by= 'Marks',ascending=False)   #use sift tab

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [108]:
df.sort_values(by= ['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## Diplay name and Marks of female student

In [111]:
df['Gender'] ==

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object